<?php

if (!defined('BASEPATH'))
    exit('No direct script access allowed');

class Err {
    public static $arErrCode = array(
        //以下为服务端错误码 
        '0000' => '操作成功',
        
        
        '1001' => '签名认证不通过',
        '1002' => '服务器异常',
        '1003' => '您的输入有误', // 参数错误
        '1004' => '操作文件失败',
        '1005' => '没有更多内容啦', // 没有可操作的数据
        '1006' => 'TOKEN设置失败', // TOKEN设置失败
        '1007' => 'TOKEN失效请重新登录',
        '1008' => 'TOKEN获取失败', // TOKEN获取失败
        '1009' => '百联三合一登录失败',
        '1010' => '请先登录,在执行操作',
        '1011' => 'MC服务器异常',
        
        '1099' => '未知错误',
        
        
        
        
        // 2001 --- 2099    用户模块错误
        '2001'  => '插入用户信息失败',
        '2002'  => '记录用户登录日志失败',
        '2003'  => '用户信息修改失败',
        '2004'  => '用户登入失败',
        '2005'  => '插入注册信息失败',
        '2006'  => '获取用户信息失败',
        '2007'  => '获取用户注册信息失败',
        '2008'  => '账户积分不足',
        '2009'  => '用户反馈内容过长',
        '2010'  => '用户联系方式过长',
        '2011'  => '反馈信息插入失败',
        '2012'  => '消息通知删除失败',
        '2013'  => '签到配置文件为空,请先配置签到信息', 
        '2014'  => '签到操作执行失败', 
        '2015'  => '签到错误',// 签到历史记录插入失败
        '2016'  => '今天已经签过啦',
        '2017'  => '该日期不允许补签',
        '2018'  => '每月最多可补签5次，您的补签机会已全部使用',
        '2019'  => '签到获得积分失败',
        '2020'  => '补签扣除积分失败',
        '2021'  => '积分变更历史插入失败',
        '2022'  => '签到游戏得分记录失败',
        '2023'  => '暂无签到游戏',
        '2024'  => '签到游戏最好成绩更新失败',
        '2025'  => '签到游戏最好成绩插入失败',
        '2026'  => '用户信息更新失败',
        '2027'  => '游戏币不足',
        '2028'  => '您当前的积分不足', 
        '2029'  => '该日期不允许签到',
        
        // 2101 --- 2199    游戏模块错误
        '2101'  => '游戏已下架',
        '2102'  => '游戏收藏失败',
        '2103'  => '取消收藏失败',
        '2104'  => '游戏分享失败',
        '2105'  => '游戏打开失败',
        '2106'  => '游戏分享次数更新失败',
        '2107'  => '游戏被打开次数更新失败',
        '2108'  => '订单插入失败,购买道具失败',
        '2109'  => '该网游暂无回调地址',
        '2110'  => '该订单不允许支付',
        '2111'  => '游戏已购买',
        '2112'  => '只允许购买金币游戏',
        '2113'  => '购买历史记录插入失败',
        '2114'  => '购买游戏游戏币扣除失败',
        '2115'  => '游戏币变更历史插入失败',
        
        
        // 2301 --- 2399    兑换错误
        '2301'  => '兑换券已下架',
        '2302'  => '该兑换券不允许重复兑换',
        '2303'  => '兑换历史记录插入失败',
        '2304'  => '兑换次数更新失败',
        '2305'  => '兑换记录删除失败',
        '2306'  => '消息快报插入失败',
        '2307'  => '旧消息快报删除失败',
        '2308'  => '兑换时游戏币扣除失败',
        '2309'  => '百联兑换接口调用失败',
           
        '2310'  => '维护,暂停服务',//兑换操作错误码
        '2311'  => '兑换操作参数错误',
        '2312'  => '非移动手机',
        '2313'  => '目前只支持移动直充',
        '2314'  => '商户已被暂停',
        '2315'  => '手机直充签名错误',
        '2316'  => 'IP不合法',
        '2317'  => '商户未开通',
        '2318'  => '请求异常',
        '2319'  => '百联黑名单,请于隔日提交',
        '2320'  => '非全国手机',
        '2321'  => '余额不足',
        '2322'  => '超过移动限额',
        '2323'  => '流量兑换失败',
        '2324'  => '话费兑换失败',
        '2325'  => '手机号格式不正确',
        '2326'  => '不允许充值上海手机号',
        
        '2327'  => '不允许兑换',
        '2328'  => '兑换状态查询失败，请稍后兑换',
        '2329'  => '兑换维护中，请稍后尝试',
        '2330'  => '兑换商品关闭失败',
        '2331'  => '不予许充上海手机号',
        
        
        // 2501 --- 2599    游戏币充值模块
        '2501'  => '游戏币充值失败',
        '2502'  => '充值订单插入失败',
        '2503'  => '订单异步通知处理失败',
        '2504'  => '该订单不允许支付',
        '2505'  => '未查询到该订单',
        '2506'  => '该订单不允许取消',
        '2507'  => '取消订单失败',
        '2508'  => '该订单不允许删除',
        '2509'  => '删除订单失败',
        '2510'  => '订单充值记录插入失败',
        '2511'  => '积分扣除失败',
        '2512'  => '积分退款失败',
        '2513'  => '订单状态更新失败',
        
        
        // 2601 --- 2699    百联认证授权 
        '2601'  => 'access_token获取失败',
        '2602'  => 'public_key获取失败',
        '2603'  => 'passport_id隐性登录失败',
        '2604'  => '百联积分查询失败',
        '2605'  => '百联积分更新失败',
        
        
        // 2701 --- 2799  夺宝错误码
        '2701'  => '重庆时时彩信息获取失败',
        '2702'  => '该夺宝商品已下架',
        '2703'  => '该商品不允许夺宝',
        '2704'  => '超过允许购买人次数',
        '2705'  => '夺宝下单插入失败',
        '2706'  => '夺宝下单人次数更新失败',
        '2707'  => '夺宝编号获取失败',
        '2708'  => '时时彩信息获取失败',
        '2709'  => '收货信息更新失败',
        '2710'  => '收货信息新增失败',
        '2711'  => '收货信息删除失败',
        '2712'  => '用户暂无该夺宝订单信息',
        '2713'  => '夺宝订单更新失败',
        '2714'  => '地址已绑定',
        '2715'  => '该订单投满',
        
    );
}
